version: "1.0"

functions:
  - module: fastopendata.registered_functions.decoder
    names: [decode_serialized]

sources:
  entities:
    - id: osm_nodes
      uri: "file:///Users/zernst/scratch/united_states_nodes.csv"
      entity_type: OSMNode
      id_col: id
      schema_hints:
        longitude: FLOAT
        latitude: FLOAT
        encoded_tags: STRING
        id: INTEGER
    - id: state_crosswalk
      uri: "file:///Users/zernst/scratch/state_county_tract_puma_crosswalk.csv"
      entity_type: State
      id_col: STATE_FIPS
      schema_hints:
        STATEFP: STRING
        COUNTYFP: STRING
        TRACTFP: STRING
        PUMA5CE: STRING
        STATE_FIPS: STRING
        COUNTY_FIPS: STRING
        TRACT_FIPS: STRING
        PUMA_FIPS: STRING
    - id: county_crosswalk
      uri: "file:///Users/zernst/scratch/state_county_tract_puma_crosswalk.csv"
      entity_type: County
      id_col: COUNTY_FIPS
      schema_hints:
        STATEFP: STRING
        COUNTYFP: STRING
        TRACTFP: STRING
        PUMA5CE: STRING
        STATE_FIPS: STRING
        COUNTY_FIPS: STRING
        TRACT_FIPS: STRING
        PUMA_FIPS: STRING
    - id: tract_crosswalk
      uri: "file:///Users/zernst/scratch/state_county_tract_puma_crosswalk.csv"
      entity_type: Tract
      id_col: TRACT_FIPS
      schema_hints:
        STATEFP: STRING
        COUNTYFP: STRING
        TRACTFP: STRING
        PUMA5CE: STRING
        STATE_FIPS: STRING
        COUNTY_FIPS: STRING
        TRACT_FIPS: STRING
        PUMA_FIPS: STRING
    - id: puma_crosswalk
      uri: "file:///Users/zernst/scratch/state_county_tract_puma_crosswalk.csv"
      entity_type: PUMA
      id_col: PUMA_FIPS
      schema_hints:
        STATEFP: STRING
        COUNTYFP: STRING
        TRACTFP: STRING
        PUMA5CE: STRING
        STATE_FIPS: STRING
        COUNTY_FIPS: STRING
        TRACT_FIPS: STRING
        PUMA_FIPS: STRING
  relationships:
    - id: county_in_state
      uri: "file:///Users/zernst/scratch/state_county_tract_puma_crosswalk.csv"
      relationship_type: IN
      source_col: COUNTY_FIPS
      target_col: STATE_FIPS
      schema_hints:
        STATEFP: STRING
        COUNTYFP: STRING
        TRACTFP: STRING
        PUMA5CE: STRING
        STATE_FIPS: STRING
        COUNTY_FIPS: STRING
        TRACT_FIPS: STRING
        PUMA_FIPS: STRING
    - id: tract_in_county
      uri: "file:///Users/zernst/scratch/state_county_tract_puma_crosswalk.csv"
      relationship_type: IN
      source_col: TRACT_FIPS
      target_col: COUNTY_FIPS
      schema_hints:
        STATEFP: STRING
        COUNTYFP: STRING
        TRACTFP: STRING
        PUMA5CE: STRING
        STATE_FIPS: STRING
        COUNTY_FIPS: STRING
        TRACT_FIPS: STRING
        PUMA_FIPS: STRING
    - id: tract_in_puma
      uri: "file:///Users/zernst/scratch/state_county_tract_puma_crosswalk.csv"
      relationship_type: IN
      source_col: TRACT_FIPS
      target_col: PUMA_FIPS
      schema_hints:
        STATEFP: STRING
        COUNTYFP: STRING
        TRACTFP: STRING
        PUMA5CE: STRING
        STATE_FIPS: STRING
        COUNTY_FIPS: STRING
        TRACT_FIPS: STRING
        PUMA_FIPS: STRING
    - id: puma_in_state
      uri: "file:///Users/zernst/scratch/state_county_tract_puma_crosswalk.csv"
      relationship_type: IN
      source_col: PUMA_FIPS
      target_col: STATE_FIPS
      schema_hints:
        STATEFP: STRING
        COUNTYFP: STRING
        TRACTFP: STRING
        PUMA5CE: STRING
        STATE_FIPS: STRING
        COUNTY_FIPS: STRING
        TRACT_FIPS: STRING
        PUMA_FIPS: STRING

queries:
  - id: counties_in_state
    description: "Get all the relationships -- test"
    inline: MATCH (s:State)<-[:IN]-(c:County) WITH DISTINCT id(s) AS state_name, id(c) AS county_name RETURN state_name, county_name

  - id: tracts_in_county
    description: "Get all the relationships -- test"
    inline: MATCH (c:County)<-[:IN]-(t:Tract) WITH DISTINCT id(c) AS county_name, id(t) AS tract_name RETURN county_name, tract_name

  - id: num_counties_in_state
    description: "Do a simple test aggregation"
    inline: MATCH (s:State)<-[:IN]-(c:County) WITH DISTINCT s, COUNT(c) AS num_counties SET s.num_counties = num_counties

  - id: over_hundred_counties
    description: "Do a simple test aggregation"
    inline: MATCH (s:State) WITH s, s.num_counties > 100 AS over_hundred_counties SET s.over_hundred_counties = over_hundred_counties

  - id: osm_longitude
    description: "Test retrieving raw longitude value"
    inline: MATCH (o:OSMNode) WITH o.longitude AS longitude, id(o) AS identifier, o SET o.foo = longitude + 1000 WITH identifier, o.foo AS foo, o.decoded_tags AS decoded_tags RETURN identifier, foo, decoded_tags

  - id: decode_tags
    description: "Testing whether we can call a function to decode serialized data"
    inline: MATCH (o:OSMNode) WITH o.encoded_tags AS encoded_tags, o SET o.decoded_tags = decode_serialized(encoded_tags)

output:
  - query_id: inside
    uri: file:///Users/zernst/git/pycypher-nmetl/packages/fastopendata/src/fastopendata/output/inside.csv
  - query_id: num_counties
    uri: file:///Users/zernst/git/pycypher-nmetl/packages/fastopendata/src/fastopendata/output/num_counties.csv
  - query_id: county_counter
    uri: file:///Users/zernst/git/pycypher-nmetl/packages/fastopendata/src/fastopendata/output/county_counter.csv
  - query_id: osm_longitude
    uri: file:///Users/zernst/git/pycypher-nmetl/packages/fastopendata/src/fastopendata/output/osm.csv
