version: "1.0"

functions:
  - module: fastopendata.registered_functions.decoder
    names: [decode_serialized]

sources:
  entities:
    - id: osm_nodes
      uri: "file:///run/media/zac/2tb/fastopendata/data/united_states_nodes_tract_crosswalk.parquet"
      entity_type: OSMNode
      id_col: id
      schema_hints:
        longitude: FLOAT
        latitude: FLOAT
        encoded_tags: STRING
        id: INTEGER
    - id: state_crosswalk
      uri: "file:///run/media/zac/2tb/fastopendata/data/state_county_tract_puma_crosswalk.csv"
      entity_type: State
      id_col: STATE_FIPS
      schema_hints:
        STATEFP: STRING
        COUNTYFP: STRING
        TRACTFP: STRING
        PUMA5CE: STRING
        STATE_FIPS: STRING
        COUNTY_FIPS: STRING
        TRACT_FIPS: STRING
        PUMA_FIPS: STRING
    - id: county_crosswalk
      uri: "file:///run/media/zac/2tb/fastopendata/data/state_county_tract_puma_crosswalk.csv"
      entity_type: County
      id_col: COUNTY_FIPS
      schema_hints:
        STATEFP: STRING
        COUNTYFP: STRING
        TRACTFP: STRING
        PUMA5CE: STRING
        STATE_FIPS: STRING
        COUNTY_FIPS: STRING
        TRACT_FIPS: STRING
        PUMA_FIPS: STRING
    - id: tract_crosswalk
      uri: "file:///run/media/zac/2tb/fastopendata/data/state_county_tract_puma_crosswalk.csv"
      entity_type: Tract
      id_col: TRACT_FIPS
      schema_hints:
        STATEFP: STRING
        COUNTYFP: STRING
        TRACTFP: STRING
        PUMA5CE: STRING
        STATE_FIPS: STRING
        COUNTY_FIPS: STRING
        TRACT_FIPS: STRING
        PUMA_FIPS: STRING
    - id: puma_crosswalk
      uri: "file:///run/media/zac/2tb/fastopendata/data/state_county_tract_puma_crosswalk.csv"
      entity_type: PUMA
      id_col: PUMA_FIPS
      schema_hints:
        STATEFP: STRING
        COUNTYFP: STRING
        TRACTFP: STRING
        PUMA5CE: STRING
        STATE_FIPS: STRING
        COUNTY_FIPS: STRING
        TRACT_FIPS: STRING
        PUMA_FIPS: STRING
    - id: tract_osm
      uri: "file:///run/media/zac/2tb/fastopendata/data/united_states_nodes_tract_crosswalk.csv"
      entity_type: Tract
      id_col: GEOID
      schema_hints:
        GEOID: STRING
        longitude: float
        latitude: float
    - id: psam_housing_survey
      uri: "file:///run/media/zac/2tb/fastopendata/data/psam_hus.parquet"
      entity_type: HousingSurvey
      id_col: SERIALNO
    - id: psam_person_survey
      uri: "file:///run/media/zac/2tb/fastopendata/data/psam_pus.parquet"
      entity_type: PersonSurvey
      id_col: SERIALNO
  relationships:
    - id: county_in_state
      uri: "file:///run/media/zac/2tb/fastopendata/data/state_county_tract_puma_crosswalk.csv"
      relationship_type: IN
      source_col: COUNTY_FIPS
      target_col: STATE_FIPS
      schema_hints:
        STATEFP: STRING
        COUNTYFP: STRING
        TRACTFP: STRING
        PUMA5CE: STRING
        STATE_FIPS: STRING
        COUNTY_FIPS: STRING
        TRACT_FIPS: STRING
        PUMA_FIPS: STRING
    - id: tract_in_county
      uri: "file:///run/media/zac/2tb/fastopendata/data/state_county_tract_puma_crosswalk.csv"
      relationship_type: IN
      source_col: TRACT_FIPS
      target_col: COUNTY_FIPS
      schema_hints:
        STATEFP: STRING
        COUNTYFP: STRING
        TRACTFP: STRING
        PUMA5CE: STRING
        STATE_FIPS: STRING
        COUNTY_FIPS: STRING
        TRACT_FIPS: STRING
        PUMA_FIPS: STRING
    - id: tract_in_puma
      uri: "file:///run/media/zac/2tb/fastopendata/data/state_county_tract_puma_crosswalk.csv"
      relationship_type: IN
      source_col: TRACT_FIPS
      target_col: PUMA_FIPS
      schema_hints:
        STATEFP: STRING
        COUNTYFP: STRING
        TRACTFP: STRING
        PUMA5CE: STRING
        STATE_FIPS: STRING
        COUNTY_FIPS: STRING
        TRACT_FIPS: STRING
        PUMA_FIPS: STRING
    - id: osm_node_in_tract
      uri: "file:///run/media/zac/2tb/fastopendata/data/united_states_nodes_tract_crosswalk.csv"
      relationship_type: IN
      source_col: id
      target_col: GEOID
      schema_hints:
        GEOID: STRING
        id:: STRING
    - id: puma_in_state
      uri: "file:///run/media/zac/2tb/fastopendata/data/state_county_tract_puma_crosswalk.csv"
      relationship_type: IN
      source_col: PUMA_FIPS
      target_col: STATE_FIPS
      schema_hints:
        STATEFP: STRING
        COUNTYFP: STRING
        TRACTFP: STRING
        PUMA5CE: STRING
        STATE_FIPS: STRING
        COUNTY_FIPS: STRING
        TRACT_FIPS: STRING
        PUMA_FIPS: STRING


queries:
  - id: counties_in_state
    description: "Get all the relationships -- test"
    inline: MATCH (s:State)<-[:IN]-(c:County) WITH DISTINCT id(s) AS state_name, id(c) AS county_name RETURN state_name, county_name

  - id: tracts_in_county
    description: "Get all the relationships -- test"
    inline: MATCH (c:County)<-[:IN]-(t:Tract) WITH DISTINCT id(c) AS county_name, id(t) AS tract_name RETURN county_name, tract_name

  - id: num_counties_in_state
    description: "Do a simple test aggregation"
    inline: MATCH (s:State)<-[:IN]-(c:County) WITH DISTINCT s, COUNT(c) AS num_counties SET s.num_counties = num_counties

  - id: over_hundred_counties
    description: "Do a simple test aggregation"
    inline: MATCH (s:State) WITH s, s.num_counties > 100 AS over_hundred_counties SET s.over_hundred_counties = over_hundred_counties

  - id: osm_longitude
    description: "Test retrieving raw longitude value"
    inline: MATCH (o:OSMNode) WITH o.longitude AS longitude, id(o) AS identifier, o SET o.foo = longitude + 1000 WITH identifier, o.foo AS foo, o.decoded_tags AS decoded_tags RETURN identifier, foo, decoded_tags

  - id: decode_tags
    description: "Testing whether we can call a function to decode serialized data"
    inline: MATCH (o:OSMNode) WITH o.encoded_tags AS encoded_tags, o SET o.decoded_tags = decode_serialized(encoded_tags)

output:
  - query_id: inside
    uri: file:///home/zac/git/pycypher-nmetl/packages/fastopendata/src/fastopendata/output/inside.csv
  - query_id: num_counties
    uri: file:///home/zac/git/pycypher-nmetl/packages/fastopendata/src/fastopendata/output/num_counties.csv
  - query_id: county_counter
    uri: file:///home/zac/git/pycypher-nmetl/packages/fastopendata/src/fastopendata/output/county_counter.csv
  - query_id: osm_longitude
    uri: file:///home/zac/git/pycypher-nmetl/packages/fastopendata/src/fastopendata/output/osm.csv




    - id: food_access
      uri: "file:///run/media/zac/2tb/fastopendata/data/Food Access Research Atlas.csv"
      entity_type: Tract
      id_col: CensusTract
      schema_hints:
        CensusTract: STRING
        State: STRING
        County: STRING
        Urban: STRING
        POP2010: STRING
        OHU2010: STRING
        GroupQuartersFlag: STRING
        NUMGQTRS: STRING
        PCTGQTRS: STRING
        LILATracts_1And10: STRING
        LILATracts_halfAnd10: STRING
        LILATracts_1And20: STRING
        LILATracts_Vehicle: STRING
        HUNVFlag: STRING
        LowIncomeTracts: STRING
        PovertyRate: STRING
        MedianFamilyIncome: STRING
        LA1and10: STRING
        LAhalfand10: STRING
        LA1and20: STRING
        LATracts_half: STRING
        LATracts1: STRING
        LATracts10: STRING
        LATracts20: STRING
        LATractsVehicle_20: STRING
        LAPOP1_10: STRING
        LAPOP05_10: STRING
        LAPOP1_20: STRING
        LALOWI1_10: STRING
        LALOWI05_10: STRING
        LALOWI1_20: STRING
        lapophalf: STRING
        lapophalfshare: STRING
        lalowihalf: STRING
        lalowihalfshare: STRING
        lakidshalf: STRING
        lakidshalfshare: STRING
        laseniorshalf: STRING
        laseniorshalfshare: STRING
        lawhitehalf: STRING
        lawhitehalfshare: STRING
        lablackhalf: STRING
        lablackhalfshare: STRING
        laasianhalf: STRING
        laasianhalfshare: STRING
        lanhopihalf: STRING
        lanhopihalfshare: STRING
        laaianhalf: STRING
        laaianhalfshare: STRING
        laomultirhalf: STRING
        laomultirhalfshare: STRING
        lahisphalf: STRING
        lahisphalfshare: STRING
        lahunvhalf: STRING
        lahunvhalfshare: STRING
        lasnaphalf: STRING
        lasnaphalfshare: STRING
        lapop1: STRING
        lapop1share: STRING
        lalowi1: STRING
        lalowi1share: STRING
        lakids1: STRING
        lakids1share: STRING
        laseniors1: STRING
        laseniors1share: STRING
        lawhite1: STRING
        lawhite1share: STRING
        lablack1: STRING
        lablack1share: STRING
        laasian1: STRING
        laasian1share: STRING
        lanhopi1: STRING
        lanhopi1share: STRING
        laaian1: STRING
        laaian1share: STRING
        laomultir1: STRING
        laomultir1share: STRING
        lahisp1: STRING
        lahisp1share: STRING
        lahunv1: STRING
        lahunv1share: STRING
        lasnap1: STRING
        lasnap1share: STRING
        lapop10: STRING
        lapop10share: STRING
        lalowi10: STRING
        lalowi10share: STRING
        lakids10: STRING
        lakids10share: STRING
        laseniors10: STRING
        laseniors10share: STRING
        lawhite10: STRING
        lawhite10share: STRING
        lablack10: STRING
        lablack10share: STRING
        laasian10: STRING
        laasian10share: STRING
        lanhopi10: STRING
        lanhopi10share: STRING
        laaian10: STRING
        laaian10share: STRING
        laomultir10: STRING
        laomultir10share: STRING
        lahisp10: STRING
        lahisp10share: STRING
        lahunv10: STRING
        lahunv10share: STRING
        lasnap10: STRING
        lasnap10share: STRING
        lapop20: STRING
        lapop20share: STRING
        lalowi20: STRING
        lalowi20share: STRING
        lakids20: STRING
        lakids20share: STRING
        laseniors20: STRING
        laseniors20share: STRING
        lawhite20: STRING
        lawhite20share: STRING
        lablack20: STRING
        lablack20share: STRING
        laasian20: STRING
        laasian20share: STRING
        lanhopi20: STRING
        lanhopi20share: STRING
        laaian20: STRING
        laaian20share: STRING
        laomultir20: STRING
        laomultir20share: STRING
        lahisp20: STRING
        lahisp20share: STRING
        lahunv20: STRING
        lahunv20share: STRING
        lasnap20: STRING
        lasnap20share: STRING
        TractLOWI: STRING
        TractKids: STRING
        TractSeniors: STRING
        TractWhite: STRING
        TractBlack: STRING
        TractAsian: STRING
        TractNHOPI: STRING
        TractAIAN: STRING
        TractOMultir: STRING
        TractHispanic: STRING
        TractHUNV: STRING
        TractSNAP: STRING
